Repository: AhmedBelal31/Fitness-Tracker-Fitrix-
Catalog: lib/l10n/intl_*.arb
Languages: ar

source: Enter Hours
ar: أدخل عدد الساعات

# min_suffix
source: min
ar: د

# hour_suffix
source: hr
ar: س

source: Challenges Badge
ar: شارة التحديات

source: Category Challenges Badge
ar: شارة فئات التحديات

# weekly_average_title
source: Weekly Average
ar: متوسط الأسبوع

# weekly_average_subtitle
source: Your productivity this week
ar: إنتاجيتك هذا الأسبوع

# weekly_label_low
source: Needs Improvement
ar: تحتاج تحسين

# weekly_label_medium
source: Getting Better
ar: في تحسن

# weekly_label_high
source: Productive
ar: منتج

# weekly_label_super
source: Super Productive
ar: منتج جدًا

# no_challenge_images_title
source: No images yet! 😊
ar: لا توجد صور بعد! 😊

# no_challenge_images_subtitle
source: Tap the + button to add your challenge images.
ar: اضغط على زر + لإضافة صور التحدي الخاصة بك.

# no_followers_title
source: No followers yet! 😊
ar: لا يوجد متابعين بعد! 😊

# no_followers_subtitle
source: Add users to see their activity and images.
ar: أضف مستخدمين لرؤية نشاطهم وصورهم.

# default_achiever
source: New Challenger
ar: متحدٍ جديد

source: Saving Progress...
ar: جاري حفظ التقدم...

# oops_title
source: Oops!
ar: أوووبس!

# not_found_subtitle
source: Page not found
ar: الصفحة غير موجودة

# contact_us_help
source: Or you can contact us for help
ar: أو يمكنك التواصل معنا للمساعدة

# share_challenge_text
source: Share the challenge with you 💪 {link}
ar: شارك التحدي معاك 💪 {link}

# share_challenge_subject
source: Challenge
ar: التحدي

# not_found_description
source: Sorry, we can’t find the page you’re looking for. Go back to the homepage.
ar: عذراً، لا يمكننا العثور على الصفحة التي تبحث عنها. ارجع إلى الصفحة الرئيسية.
