Repository: AhmedBelal31/Fitness-Tracker-Fitrix-
Catalog: lib/l10n/intl_*.arb
Languages: ar

# email
source: Email Address
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور

source: Please enter email
ar: من فضلك أدخل بريدك الإلكتروني

# please_enter_valid_email
source: Please enter a valid email address
ar: يبدو أن البريد الإلكتروني غير صحيح، حاول مرة أخرى

source: Please enter your password
ar: أدخل كلمة المرور الخاصة بك

source: Remember me
ar: تذكرني

source: Forgot password?
ar: نسيت كلمة المرور؟

source: Login
ar: تسجيل الدخول

source: Continue with Google
ar: سجّل دخولك عبر Google

source: Continue with Facebook
ar: سجّل دخولك عبر Facebook

source: Continue with Apple
ar: سجّل دخولك عبر Apple

source: OR
ar: أو

source: Don't have an account?
ar: ليس لديك حساب بعد؟

source: Sign up
ar: إنشاء حساب جديد

source: Please enter your First Name
ar: أدخل اسمك الأول

source: First Name
ar: الاسم الأول

source: Last Name
ar: الاسم الأخير

source: Please enter your Last Name
ar: أدخل اسمك الأخير

source: Password must be at least 8 characters
ar: يجب أن تحتوي كلمة المرور على 8 أحرف على الأقل

source: Please enter password
ar: يرجى إدخال كلمة المرور

source: SETTINGS
ar: الإعدادات

source: Reset Password
ar: إعادة تعيين كلمة المرور

source: Enter Your Email To Receive Reset Code
ar: أدخل بريدك الإلكتروني لنرسل لك رمز إعادة التعيين

# continuex
source: Continue
ar: متابعة

# we_have_sent_an_email_to
source: We've sent an email to
ar: تم إرسال بريد إلكتروني إلى

source: Enter Code
ar: أدخل الرمز

source: Please enter code sent to your email
ar: أدخل الرمز الذي أرسلناه إلى بريدك الإلكتروني

# didnt_receive_code
source: Didn't receive a code.
ar: لم يصلك الرمز؟

source: Resend
ar: إعادة الإرسال

source: VERIFY YOUR IDENTITY
ar: تحقق من هويتك

source: Enter your new password
ar: أدخل كلمة المرور الجديدة

source: New Password
ar: كلمة مرور جديدة

source: Confirm New Password
ar: تأكيد كلمة المرور الجديدة

source: Please confirm your password
ar: يرجى تأكيد كلمة المرور

source: Passwords do not match
ar: كلمتا المرور غير متطابقتين

source: FINISH
ar: إنهاء

source: RATE APP
ar: قيّم التطبيق

source: REVIEW
ar: أضف مراجعة

source: Logout
ar: تسجيل الخروج

source: Account
ar: حسابي

source: Edit Your Profile
ar: تعديل ملفي الشخصي

source: Change Your Password
ar: تغيير كلمة المرور

source: Notifications
ar: الإشعارات

source: More
ar: المزيد

source: Languages
ar: اللغات

source: PROFILE
ar: ملفي الشخصي

source: Change Photo
ar: تغيير الصورة الشخصية

source: Profile Updated Successfully
ar: تم تحديث الملف الشخصي بنجاح!

source: Failed to update profile
ar: حدث خطأ أثناء تحديث الملف الشخصي

source: Retry
ar: إعادة المحاولة

source: Update
ar: تحديث

source: Choose from Gallery
ar: اختر صورة من المعرض

source: Take a Picture
ar: التقاط صورة جديدة

source: Enter New Password
ar: أدخل كلمة مرور جديدة

source: Daily Notifications
ar: الإشعارات اليومية

# push_notification_every_day
source: Push notification at the specified time every day
ar: إشعار يومي لتذكيرك بأهدافك

source: ON
ar: تشغيل

source: OFF
ar: إيقاف

source: Daily Notification Time
ar: وقت الإشعار اليومي

source: Select Time
ar: اختر الوقت

source: Notifications Quotes
ar: اقتباسات ملهمة للإشعارات

source: Add Quote
ar: إضافة اقتباس جديد

source: Quotes
ar: الاقتباسات

source: Show Suggestions
ar: عرض الاقتراحات

source: Choose a Motivational Quote
ar: اختر اقتباسًا تحفيزيًا

source: No more quotes available.
ar: لا توجد اقتباسات أخرى حاليًا

source: Cancel
ar: إلغاء

source: Add Motivational Quote
ar: إضافة اقتباس ملهم

source: Type your motivational quote...
ar: اكتب اقتباسك التحفيزي هنا...

source: Save
ar: حفظ

source: Days
ar: يوم

source: Edit Notification
ar: تعديل الإشعار

source: Edit your message
ar: عدل رسالتك

source: MY CHALLENGES
ar: تحدياتي

source: RECOMMENDED FOR YOU
ar: مقترح لك

source: View All
ar: عرض الكل

source: Great, your today’s plan almost done
ar: رائع! أوشكت على إنهاء خطتك لليوم

source: View challenges
ar: استعرض التحديات

source: Followers List
ar: قائمة المتابعين

source: Followers
ar: المتابعون

source: Following
ar: تتابع

source: Likes
ar: الإعجابات

source: Daily Challenges
ar: تحديات اليوم

source: This email is not associated with your account
ar: هذا البريد الإلكتروني ليس مرتبط بحسابك

source: Unexpected error occurred
ar: حدث خطأ ما

# error_400
source: Oops! There's something wrong with the information you entered. Please check and try again.
ar: الإيميل اللي دخلته مش موجود، جرب إيميل تاني.

# error_401
source: The email or password you entered is incorrect. Please try again.
ar: البريد الإلكتروني أو كلمة المرور التي أدخلتها غير صحيحة. يرجى المحاولة مرة أخرى.

# error_401_403
source: Sorry, you need to be logged in to do that. Please log in or create an account.
ar: يبدو أنك غير مسجل، سجل دخولك وجرب تاني.

# error_404
source: We couldn't find what you were looking for. It might be missing or the link might be broken.
ar: الحاجة اللي بتدور عليها مش موجودة، حاول لاحقًا.

# error_405
source: Sorry, you're not allowed to do that. Please try a different way.
ar: فيه مشكلة في الطلب، حاول كمان شوية.

# error_406
source: Something went wrong. Please try again or contact us if the problem continues.
ar: فيه حاجة مش متوافقة، جرب مرة تانية.

# error_408
source: The request took too long. Please check your internet connection and try again.
ar: الطلب أخد وقت طويل، جرب كمان شوية.

# error_409
source: There's a conflict with the data. Please try again later or contact us.
ar: فيه تعارض في البيانات، جرب تاني بعد لحظات.

# error_410
source: This content is no longer available.
ar: المحتوى اللي بتدور عليه مش متاح دلوقتي.

# error_411
source: Some information is missing. Please fill in all the required fields.
ar: فيه بيانات ناقصة، جرب تضيف كل المطلوب.

# error_412
source: Your request didn't meet the requirements. Please check and try again.
ar: فيه حاجة مش متوافقة مع الشروط، جرب تاني.

# error_413
source: The file you uploaded is too large. Please choose a smaller file.
ar: البيانات اللي دخلتها كبيرة جدًا، حاول تقلل حجمها.

# error_414
source: The website address is too long. Please try a shorter one.
ar: اللينك اللي استخدمته طويل جدًا، جرب لينك أقصر.

# error_415
source: There's a problem with the file you uploaded. Please try a different file type.
ar: فيه مشكلة في الملف اللي رفعته، جرب صيغة مختلفة.

# error_422
source: The information you entered is not valid. Please check and try again.
ar: البيانات مش واضحة، تأكد منها وجرب تاني.

# error_429
source: You're making too many requests. Please try again later.
ar: انت طلبت كتير في وقت قليل، جرب كمان شوية.

# error_500
source: Oops! Something went wrong on our end. Please try again later.
ar: فيه مشكلة عندنا، حاول لاحقًا.

# error_501
source: This feature is not available yet. Please check back later.
ar: الميزة دي مش متاحة دلوقتي، حاول لاحقًا.

# error_502
source: We're having trouble connecting to the server. Please try again later.
ar: فيه مشكلة في الاتصال بالسيرفر، جرب كمان شوية.

# error_503
source: The service is temporarily unavailable. Please try again later.
ar: الخدمة مش متاحة دلوقتي، حاول لاحقًا.

# error_504
source: The connection timed out. Please check your internet connection and try again.
ar: الاتصال أخد وقت طويل، حاول تاني.

# error_505
source: This request is not supported. Please try a different way.
ar: الطلب اللي بعته مش مدعوم، جرب طريقة تانية.

# error_unexpected
source: An unexpected error occurred, try again later.
ar: حصلت مشكلة غير متوقعة، حاول لاحقًا.

source: VIEW ALL CHALLENGES
ar: عرض جميع التحديات

source: VIEW ALL COURSES
ar: عرض جميع الدورات

source: DEVELOP YOURSELF
ar: طور نفسك

source: CHALLENGES
ar: التحديات

source: Video
ar: ڤيديو

source: Your Challenge Type
ar: نوع التحدي الخاص بك

source: Your Challenge Name
ar: اسم التحدي الخاص بك

source: Task
ar: المهمة

source: Amount
ar: الكمية

source: Time
ar: الوقت

source: Add New Challenge
ar: اضافة تحدي جديد

source: Please enter your challenge name
ar: ادخل اسم التحدي الخاص بك

source: Achievement
ar: الانجازات

source: Badge
ar: الشارة

source: Follow
ar: متابعة

# days_badge
source: Days Badges
ar: شارات الأيام

source: Challenges Badges
ar: شارات التحديات

source: LAST WEEK PROGRESS
ar: تقدم الأسبوع الماضي

source: THIS WEEK PROGRESS
ar: تقدم هذا الأسبوع

source: VIEW ALL PROGRESS
ar: عرض جميع التقدمات

source: Day
ar: اليوم

source: Best Achiever
ar: أفضل منجز

source: Daily Progress
ar: التقدم اليومي

source: How Are You Feeling Today
ar: كيف تشعر اليوم؟

source: Your mood today
ar: مزاجك اليوم

source: Great
ar: رائع

source: Good
ar: جيد

# ok
source: Okay
ar: نعم

source: Bad
ar: سيئ

source: Surprised
ar: مندهش

source: Join Team
ar: انضم إلى الفريق

source: Like
ar: إعجاب

source: Comment
ar: تعليق

source: Join Challenge
ar: انضم إلى التحدي

source: Lesson
ar: درس

source: Your plan will create now
ar: سيتم إنشاء خطتك الآن

# end_of_book
source: End of the Book
ar: نهاية الكتاب

source: 🎉 Congratulations! 🎉
ar: 🎉 مبروك! 🎉

# book_finished_successfully
source: You have successfully finished the book
ar: لقد أنهيت الكتاب بنجاح

# hope_you_enjoyed_reading
source: We hope you enjoyed the reading and gained great value
ar: نأمل أن تكون قد استمتعت بالقراءة وحصلت على فائدة كبيرة

source: Achievement Unlocked
ar: إنجازات محققة

source: Book Completed
ar: كتاب مكتمل

source: Knowledge Gained
ar: معرفة مكتسبة

source: Wisdom Achieved
ar: حكمة محققة

source: Return to Home
ar: العودة للرئيسية

source: Read Another Book
ar: اقرأ كتاباً آخر

source: Failed to load data
ar: فشل تحميل البيانات

source: Prayer Times
ar: مواقيت الصلاة

source: Fajr
ar: الفجر

source: Sunrise
ar: الشروق

source: Dhuhr
ar: الظهر

source: Asr
ar: العصر

source: Maghrib
ar: المغرب

source: Isha
ar: العشاء

source: Prayed
ar: صلّيت

source: Missed
ar: فاتتني

source: Unmarked
ar: غير محددة

source: Daily Reading Challenge
ar: تحدي القراءة اليومي

source: Book
ar: كتاب

source: No courses available for this category
ar: لا توجد كورسات لهذه الفئة

source: All
ar: الكل

source: Courses
ar: دورات تعليمية

source: Join Them
ar: انضم إليهم

source: No Challenges for now
ar: لا توجد تحديات لهذا اليوم

source: Upload Your Photo
ar: ارفع صورتك

source: Date of Birth
ar: تاريخ الميلاد

# birth_date_question
source: Birth Date ?
ar: ما تاريخ الميلاد؟

source: Gender
ar: النوع

source: Next
ar: التالي

source: Please Select Gender
ar: من فضلك اختر النوع

# please_select_birth_date
source: Please Select Date of Birth
ar: من فضلك اختر تاريخ الميلاد

source: male
ar: ذكر

source: LET US KNOW ABOUT YOUR SELF
ar: دعنا نتعرف عليك

source: What are you interested in
ar: بماذا أنت مهتم؟

# account_created_successfully
source: 🎉Awesome! Your account’s ready — just a few quick steps to go!
ar: 🎉يلا بينا نكمّل! حسابك جاهز، فاضل بس شوية حاجات بسيطة.

# completed_successfully
source: You did it! Welcome to the crew!😎
ar: خلصت كل حاجة؟ إنت كده واحد مننا بجد!😍

source: Failed to load interests
ar: فشل في تحميل الاهتمامات

source: No interests found
ar: لم يتم العثور على اهتمامات

source: Update user info failed
ar: فشل في تحديث بيانات المستخدم

source: Not Prayed
ar: لم أصلي

source: Late
ar: متأخر

source: On Time
ar: في الوقت

source: In Jamaah
ar: في جماعة

source: Not Available
ar: غير متاح

source: YouTube
ar: يوتيوب

source: Choose Watching Method
ar: اختر طريقة المشاهدة

# watch_in_app_or_youtube
source: Would you like to watch the video in-app or on YouTube?
ar: هل تود مشاهدة الفيديو داخل التطبيق أو على يوتيوب؟

source: In App
ar: داخل التطبيق

# open_in_youtube
source: Open on YouTube
ar: فتح على يوتيوب

source: Video Settings
ar: إعدادات الفيديو

source: Quality
ar: الجودة

source: Playback Speed
ar: سرعة التشغيل

source: Volume
ar: الصوت

source: Reset
ar: إعادة تعيين

source: Done
ar: تم

source: Failed to load questions
ar: فشل تحميل الاسئلة

# choose_what_you_like
source: Pick what you love 💛
ar: اختار اللي يعجبك 💛

source: Yes
ar: نعم

source: No
ar: لا

source: Skip
ar: تخطي

source: Select...
ar: اختر...

source: No questions found
ar: لم يتم العثور على اسئلة

source: There is No Categories
ar: لا توجد فئات

source: Time
ar: وقت

source: How often do you want to do it?
ar: كم مرة تريد أن تفعل ذلك؟

source: Stopwatch
ar: ساعة التوقيف

source: Countdown
ar: العد التنازلي

source: Enter amount
ar: أدخل الكمية

source: Enter Other Number
ar: أدخل رقماً آخر

source: Every Day
ar: كل يوم

# specific_days_week
source: Specific Days Of The Week
ar: أيام محددة في الأسبوع

# specific_days_month
source: Specific Days Of The Month
ar: أيام محددة في الشهر

# specific_days_year
source: Specific Days Of The Year
ar: أيام محددة في السنة

source: Repeat
ar: تكرار

source: Saturday
ar: السبت

source: Sunday
ar: الأحد

source: Monday
ar: الاثنين

source: Tuesday
ar: الثلاثاء

source: Wednesday
ar: الأربعاء

source: Thursday
ar: الخميس

source: Friday
ar: الجمعة

source: January
ar: يناير

source: February
ar: فبراير

source: March
ar: مارس

source: April
ar: أبريل

source: May
ar: مايو

source: June
ar: يونيو

source: July
ar: يوليو

source: August
ar: أغسطس

source: September
ar: سبتمبر

source: October
ar: أكتوبر

source: November
ar: نوفمبر

source: December
ar: ديسمبر

source: SUN
ar: أحد

source: MON
ar: إثنين

source: TUE
ar: ثلاثاء

source: WED
ar: أربعاء

source: THU
ar: خميس

source: FRI
ar: جمعة

source: SAT
ar: سبت

source: Every
ar: كل

# mood_not_detected
source: Couldn't detect the user's mood.
ar: لم أتمكن من تحديد الحالة المزاجية للمستخدم.

# mood_save_failed
source: Failed to save the user's mood.
ar: فشل في حفظ الحالة المزاجية للمستخدم.

source: Something went wrong
ar: حدث شيء غير صحيح

source: Invalid Action
ar: إجراء غير صالح

# cannot_set_future_prayer
source: You can't set the prayer status for a future day.
ar: لا يمكنك تعيين حالة الصلاة ليوم لم يأتِ بعد.

# too_late_to_edit_prayer
source: Too much time has passed since this day, and it can no longer be edited.
ar: مرّ وقت طويل ولا يمكنك تعديل هذه الصلاة

# cannot_view_future_day
source: You cannot view a day that hasn't come yet
ar: لا يمكن عرض صلوات يوم لم يأتِ بعد

source: Challenge created successfully!
ar: تم انشاء التحدي بنجاح

# invalid_amount
source: Please enter a valid amount
ar: الكمية غير صالحة

source: Updated Successfully
ar: تم التحديث بنجاح

source: Create Zikr
ar: أنشئ ذكرك الخاص

source: Image uploaded successfully.
ar: تم حفظ الصور بنجاح

# select_at_least_two_interest
source: Please select at least two interest.
ar: اختر على الأقل اهتمامين

# reset_confirmation_title
source: Confirm Reset
ar: تأكيد إعادة التصفير

# reset_confirmation_content
source: Are you sure you want to reset all Azkar?
ar: هل أنت متأكد أنك تريد تصفير كل الأذكار؟

# zikr_saved_successfully
source: Zikr counters saved successfully
ar: تم حفظ الأذكار بنجاح

# zikr_reset_successfully
source: 🔄 Counters have been reset successfully
ar: تم إعادة التهيئة بنجاح

# zikr_save_error
source: An error occurred while saving, please try again
ar: حدث خطأ أثناء الحفظ، حاول مرة أخرى

# session_expired
source: Your session has expired. Please log in again.
ar: انتهت جلستك. يرجى تسجيل الدخول مرة أخرى.

# goal_achieved_title
source: 🎉 Congrats! You reached your goal!
ar: 🎉 مبروك! وصلت لهدفك!

# goal_achieved_message
source: Keep going and achieve more!
ar: استمر وحقق المزيد من الإنجازات!

# no_challenges_today
source: No challenges for this day yet! Add or join one 😊
ar: لا توجد تحديات لهذا اليوم بعد! أضف أو انضم 😊

# edit_challenge_not_allowed
source: You can only edit the challenge on its current day
ar: لا يمكن تعديل التحدي إلا في يومه الحالي

source: Prayer Tracking
ar: تتبع الصلاة

source: 🎉 Congratulations! All challenges completed!
ar: 🎉 مبروك! تم إنجاز جميع التحديات!

source: Good progress! Keep going 💪
ar: تقدم جيد! استمر 💪

source: Nice start! Continue your challenges 🔥
ar: بداية جيدة! أكمل تحدياتك 🔥

source: Start your daily challenges! 🚀
ar: ابدأ تحدياتك اليومية! 🚀

# daily_completion_title_1
source: 🎉 Congratulations! Perfect Day!
ar: 🎉 مبروك! يوم مثالي!

# daily_completion_message_1
source: You completed all your challenges today! Keep up this amazing achievement 💪✨
ar: لقد أنجزت جميع تحدياتك اليوم! استمر في هذا الإنجاز الرائع 💪✨

# daily_completion_title_2
source: 🌟 Fantastic Achievement!
ar: 🌟 إنجاز رائع!

# daily_completion_message_2
source: All challenges completed! You're a true warrior 🏆
ar: جميع التحديات مكتملة! أنت محارب حقيقي 🏆

# daily_completion_title_3
source: 🔥 Day Full of Achievement!
ar: 🔥 يوم مليء بالإنجاز!

# daily_completion_message_3
source: 100% completed! This is what I call excellence 🚀
ar: 100% مكتمل! هذا ما أسميه التفوق 🚀

# congratulations_title
source: Congrats 🎉
ar: تهنئة! 🎉

source: Well done! 🎉
ar: أحسنت! 🎉

source: Great achievement!
ar: إنجاز رائع!

source: No challenges available for this category
ar: لا توجد تحديات متاحة لهذه الفئة

# goal_title_1
source: 🎉 Congrats!
ar: 🎉 مبروك!

# goal_title_2
source: 🔥 Awesome!
ar: 🔥 هايل!

# goal_title_3
source: 👏 Well done!
ar: 👏 برافو!

# goal_title_4
source: 🚀 Great!
ar: 🚀 عظيم!

# goal_title_5
source: 💪 Strong!
ar: 💪 قوي!

# goal_title_6
source: ✨ Excellent!
ar: ✨ ممتاز!

# goal_title_7
source: 🌟 Superb!
ar: 🌟 رائع!

# goal_title_8
source: 🥳 Nice!
ar: 🥳 جميل!

# goal_title_9
source: 🏆 Winner!
ar: 🏆 بطل!

# goal_title_10
source: 📈 Progress!
ar: 📈 تقدّم!

# goal_message_1
source: 🎉 Congratulations! You completed the challenge!
ar: 🎉 مبروك! خلصت التحدي بنجاح!

# goal_message_2
source: 🔥 Great work! Another challenge done.
ar: 🔥 شغل جامد! تحدي خلص.

# goal_message_3
source: 👏 Well played! Challenge completed.
ar: 👏 برافو! التحدي اتقفل.

# goal_message_4
source: 🚀 Awesome! One more step forward.
ar: 🚀 ممتاز! خطوة جديدة لقدام.

# goal_message_5
source: 💪 Strong and determined! Challenge finished.
ar: 💪 قوة وعزيمة! التحدي خلص.

# goal_message_6
source: ✨ Excellent job, you nailed it!
ar: ✨ رائع، خلصت التحدي بكل نجاح.

# goal_message_7
source: 🌟 Another challenge conquered!
ar: 🌟 شاطر! تحدي جديد وراك.

# goal_message_8
source: 🥳 Fantastic! Challenge completed.
ar: 🥳 هايل، خلصت التحدي!

# goal_message_9
source: 🏆 Victory! That challenge is behind you.
ar: 🏆 إنجاز جديد! التحدي خلص.

# goal_message_10
source: 📈 Progress made! Keep going strong.
ar: 📈 تقدّم مستمر! كمل كده.

source: I'm here for you ❤️
ar: أنا معاك ❤️

# helpful_suggestions
source: Suggestions to feel better
ar: اقتراحات تخليك أحسن

# need_personal_space
source: I need some personal space
ar: عايز مساحة لوحدي

# bad_mood_message_1
source: I don't know what's bothering you, but I'm here if you want to talk 🤗
ar: مش عارف إيه اللي مضايقك، بس أنا هنا لو عايز تتكلم 🤗

# bad_mood_message_2
source: Tough day? It's okay, tomorrow will be better God willing 💙
ar: اليوم صعب؟ خلاص، بكرة هيبقى أحسن إن شاء الله 💙

# bad_mood_message_3
source: Feeling like you're not okay? It's normal, we all go through days like this
ar: حاسس إنك مش تمام؟ عادي كلنا بنمر بأيام زي دي

# bad_mood_message_4
source: You don't have to be strong all the time, sometimes we need to feel sad
ar: مش لازم تكون كويس طول الوقت، أحياناً نحتاج نحس بالحزن

# bad_mood_message_5
source: It's just a bad day, not a bad life 🌅
ar: هي مجرد يوم وحش، مش حياة وحشة كلها 🌅

# bad_mood_message_6
source: Want to talk a bit? Or do you want space alone?
ar: عايز نتكلم شوية؟ أو عايز مساحة لوحدك؟

# bad_mood_message_7
source: I know this time is hard for you, but you're stronger than this 💪
ar: اعرف إن الوقت ده صعب عليك، بس إنت أقوى من كده 💪

# activities_help_you
source: Things that might help you 💙
ar: حاجات ممكن تساعدك 💙

source: Deep breathing
ar: تنفس عميق

# deep_breathing_desc
source: 5 minutes of calm breathing
ar: 5 دقايق تنفس هادي

# listen_music
source: Listen to music
ar: اسمع موسيقى

# listen_music_desc
source: A song you love
ar: أغنية بتحبها

# take_walk
source: Take a walk
ar: اتمشى شوية

# take_walk_desc
source: Even if just 10 minutes
ar: حتى لو 10 دقايق

# call_someone
source: Call someone close
ar: اتكلم مع حد قريب

# call_someone_desc
source: A friend or family
ar: صديق أو أهلك

# write_feelings
source: Write your feelings
ar: اكتب مشاعرك

# write_feelings_desc
source: On paper or phone
ar: على ورقة أو في التليفون

source: Thank you
ar: شكراً

# space_message_1
source: Alright, take the time you need. I'll be here when you're ready 🤗
ar: تمام، خد الوقت اللي إنت محتاجه. أنا هبقى هنا لما تبقى جاهز 🤗

# space_message_2
source: No problem, sometimes we need to be alone for a while. Take care of yourself ❤️
ar: مفيش مشكلة، أحياناً إحنا محتاجين نبقى لوحدينا شوية. اعتني بنفسك ❤️

# space_message_3
source: You know yourself better than anyone. Take your time and come back when you feel like it 🌸
ar: إنت عارف نفسك أكتر من أي حد. خد راحتك وإرجعلي لما تحس إنك عايز 🌸

# space_message_4
source: Personal space is important. Use it for something you love or just relax 💙
ar: المساحة الشخصية مهمة. استغلها في حاجة تحبها أو بس استرخي 💙

source: Achiever User
ar: مستخدم أتشيڤر

# timeline_header
source: Friends' Timeline
ar: أنشطة الأصدقاء

source: No participants found
ar: لا يوجد مشاركين في هذا التحدي حتى الآن

source: Something went wrong .
ar: حدث خطأ ما

source: Loading participants...
ar: جارٍ تحميل المشاركين...

# join_challenge_confirmation_title
source: Join Challenge
ar: انضمام للتحدي

# join_challenge_confirmation_message
source: Are you sure you want to join the "{challengeTitle}" challenge?
ar: هل أنت متأكد من أنك تريد الانضمام إلى تحدي "{challengeTitle}"؟

source: Join Now
ar: انضم الآن

source: Joining...
ar: جاري الانضمام...

source: Success
ar: نجح

source: Error
ar: خطأ

source: Got it
ar: فهمت

source: Delete Confirmation
ar: تأكيد الحذف

# delete_confirmation_message
source: Are you sure you want to delete "{itemName}"?
ar: هل أنت متأكد من أنك تريد حذف "{itemName}"؟

source: Delete
ar: احذف

# logout_confirmation_message
source: Are you sure you want to logout?
ar: هل أنت متأكد من أنك تريد تسجيل الخروج؟

source: Stay
ar: البقاء

source: Loading...
ar: جارٍ التحميل...

source: Quran Reading
ar: قراءة القرآن

source: Azkar
ar: الأذكار

source: Leave Challenge
ar: مغادرة التحدي

source: Leaving...
ar: جاري المغادرة...

# leave_challenge_confirmation_title
source: Leave Challenge
ar: مغادرة التحدي

# leave_challenge_confirmation_message
source: Are you sure you want to leave {challengeTitle}?
ar: هل أنت متأكد أنك تريد مغادرة {challengeTitle}؟

source: Leave Now
ar: غادر الآن

source: Search in challenges
ar: ابحث في التحديات

source: No search results
ar: لا توجد نتائج للبحث

# motivational_join_challenges
source: Ready for the next challenge? 💪 Come back and join now!
ar: جاهز للتحدي القادم؟ 💪 ارجع وشارك التحديات الآن!

source: Interests
ar: الاهتمامات

# categories_update_success
source: Categories list has been updated successfully ✅
ar: تم تحديث قائمة الفئات بنجاح ✅

source: Go to Page
ar: الذهاب إلى صفحة

# enter_page_number
source: Enter page number ({min} - {max})
ar: أدخل رقم الصفحة ({min} - {max})

source: Page Number
ar: رقم الصفحة

source: Go
ar: اذهب

# bookmark_saved
source: Page {pageNumber} saved successfully
ar: تم حفظ الصفحة {pageNumber} بنجاح

# pdf_load_error
source: Failed to load PDF: {error}
ar: فشل في تحميل ملف PDF: {error}

# page_indicator
source: Page {current} of {total}
ar: صفحة {current} من {total}

# saved_page
source: Saved: Page {pageNumber}
ar: محفوظة: صفحة {pageNumber}

source: No data available
ar: لا توجد بيانات متاحة

# page_number_exceeds_total
source: The entered page number is greater than the total pages ({totalPages})
ar: رقم الصفحة المدخل أكبر من عدد الصفحات المتاحة ({totalPages})

# congratulations_message
source: You have successfully completed reading the book
ar: لقد أكملت قراءة الكتاب بنجاح

source: Total Pages
ar: عدد الصفحات

source: Last Saved Page
ar: آخر صفحة محفوظة

source: Back to Last Page
ar: العودة للصفحة الأخيرة

source: Back to Home
ar: العودة للرئيسية

source: Select Time Duration
ar: حدد مدة الوقت

source: Minutes
ar: دقائق

source: Hours
ar: ساعات

source: Enter Custom Time
ar: أدخل وقت مخصص

source: Enter Time Duration
ar: أدخل مدة الوقت

source: Invalid Time Duration
ar: مدة وقت غير صحيحة

source: Enter Minutes
ar: أدخل عدد الدقائق
